filch/app/views/platform/index.html.erb

<div class="row">
  <% @rants=Rant.all %>
---
SELECT "rants".* FROM "rants"


                  <% @comments=Comment.where(rant_id:rant.id) %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."rant_id" = ?  [["rant_id", 1]]