filch/app/controllers/user/sessions_controller.rb

  def create
     user = User.where(email: params[:user][:email]).first
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "ajaltermatt@miuandes.cl"], ["LIMIT", 1]]