filch/app/controllers/blacklists_controller.rb

  def index
    @blacklists = Blacklist.all
---
SELECT "blacklists".* FROM "blacklists"

  def create
    @blacklist = Blacklist.new(blacklist_params)

    respond_to do |format|
      if @blacklist.save
---
INSERT INTO "blacklists" ("user_id", "flagged", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["flagged", 2], ["created_at", "2019-07-08 19:04:28.747985"], ["updated_at", "2019-07-08 19:04:28.747985"]]

    def set_blacklist
      @blacklist = Blacklist.find(params[:id])
---
SELECT  "blacklists".* FROM "blacklists" WHERE "blacklists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]