filch/app/controllers/geofences_controller.rb

  def index
    @geofences = Geofence.all
---
SELECT "geofences".* FROM "geofences"