filch/app/controllers/rants_controller.rb

SELECT "rants".* FROM "rants"
---
  def index
    @rants = Rant.all

INSERT INTO "rants" ("user_id", "title", "description", "like", "unlike", "status", "inapropiate", "visibility", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @rant = Rant.new(rant_params)

    respond_to do |format|
      if @rant.save

UPDATE "rants" SET "updated_at" = ? WHERE "rants"."id" = ?  [["updated_at", "2019-07-08 04:06:10.944495"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @rant.update(rant_params)

SELECT  "rants".* FROM "rants" WHERE "rants"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_rant
      @rant = Rant.find(params[:id])