filch/app/controllers/users_controller.rb

  def show
    @rants=Rant.where(user_id:current_user.id)
---
SELECT "rants".* FROM "rants" WHERE "rants"."user_id" = ?  [["user_id", 1]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = ? WHERE "users"."id" = ?  [["updated_at", "2019-07-08 14:13:51.086475"], ["id", 1]]