filch/app/views/rants/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."rant_id" = ?  [["rant_id", 1]]
---

                  <% @comments=Comment.where(rant_id:rant.id) %>