filch/app/views/users/show.html.erb

  <div class="row">
    <% @rants=Rant.where(user_id:current_user.id) %>
---
SELECT "rants".* FROM "rants" WHERE "rants"."user_id" = ?  [["user_id", 1]]


                  <% @comments=Comment.where(rant_id:rant.id) %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."rant_id" = ?  [["rant_id", 1]]